---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetSet.ForwardIterator
source: html/ea3d1abb-4420-d7c5-712d-b79ea5ca20ff.htm
---
# Autodesk.Revit.DB.Visual.AssetSet.ForwardIterator Method

## Syntax (C#)
```csharp
public virtual AssetSetIterator ForwardIterator()
```